#### HasRepeatingReferenceSource Method

---

|  |
| --- |
| RepeatingReferenceSource Class   See Also |

Determines whether an element has any repeating reference sources that can be used when creating component repeaters.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static bool HasRepeatingReferenceSource( 	Document document, 	ElementId elementId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function HasRepeatingReferenceSource ( _ 	document As Document, _ 	elementId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool HasRepeatingReferenceSource( 	Document^ document,  	ElementId^ elementId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document that contains the element.

elementId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the element.

#### Return Value

True if the element has any repeating reference sources.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The element elementId does not exist in the document |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

RepeatingReferenceSource Class

Autodesk.Revit.DB Namespace